var i18n = window.i18n || {};

i18n.error = '시스템 오류가 발생했습니다.';

// login
i18n.login_empty_id           = '아이디를 입력해 주세요.';
i18n.login_empty_pw           = '비밀번호를 입력해 주세요.';
i18n.login_invalid_param      = '잘못된 접근입니다.';
i18n.login_invalid_respondent = '참여자 정보를 찾을 수 없습니다.';
i18n.login_invalid_id_or_pw   = '참여자 아이디 또는 비밀번호가 올바르지 않습니다.';

// list
i18n.list_already_complete = '이미 완료된 진단입니다.';

// view
i18n.view_05020000_01 = '최소 {0} ~ 최대 {1}개까지 선택 가능합니다.';

i18n.view_05030000_01 = '중복 선택을 허용하지 않는 문항입니다.';

i18n.view_05050000_01 = '최소 {0} ~ 최대 {1}개까지 선택 가능합니다.';

i18n.view_05060000_01 = '중복 선택을 허용하지 않는 문항입니다.';

i18n.view_05070000_01 = '최대 {0} 글자까지 입력 가능합니다.';

i18n.view_05090000_01 = '숫자만 입력 가능합니다.';
i18n.view_05090000_02 = '최소 1에서 최대 {0} 범위의 숫자만 입력 가능합니다.';

i18n.view_05100000_01 = '숫자를 입력해 주세요.';
i18n.view_05100000_02 = '최대 합계 {0}이 되도록 입력해 주세요.';

i18n.view_05120000_01 = '최소 {0} ~ 최대 {1}개까지 선택 가능합니다.';

// form - 임시 저장
i18n.form_preview = '관리자 미리보기 중입니다.\n미리보기 중에는 임시저장, 불러오기, 제출 기능을 사용할 수 없습니다.';

i18n.form_load_temp_form_pw     = '비밀번호를 입력해 주세요.';
i18n.form_load_temp_form_comp   = '불러오기가 완료되었습니다.';
i18n.form_load_temp_form_clear  = '불러오기 진행 시 현재까지 답변하신 내용이 모두 임시저장한 답변으로 변경됩니다. 진행하시겠습니까?';
i18n.form_load_invalid_param    = '잘못된 요청입니다.';
i18n.form_load_invalid_password = '비밀번호가 올바르지 않습니다.';

i18n.form_first_page    = '첫번째 페이지입니다.';
i18n.form_last_page     = '마지막 페이지입니다.';
i18n.form_is_comp       = '응답 완료하시겠습니까?';
i18n.form_comp          = '저장이 완료되었습니다.';
i18n.form_invalid_param = '잘못된 요청입니다.';

i18n.form_temp_save_pw1  = '비밀번호를 입력해 주세요.';
i18n.form_temp_save_pw2  = '비밀번호가 일치하지 않습니다.';
i18n.form_temp_save_comp = '임시 저장되었습니다.';

// form
i18n.form_05010000_01 = '"{0}" 문항의 답변을 선택해 주세요.';
i18n.form_05010000_02 = '"{0}" 문항의 답변을 입력해 주세요.';

i18n.form_05020000_01 = '"{0}" 문항의 답변을 최소 {1}개에서 최대 {2}개까지 선택해 주세요.';
i18n.form_05020000_02 = '"{0}" 문항의 답변을 입력해 주세요.';

i18n.form_05030000_01 = '"{0}" 문항의 {1}번째 답변을 선택해 주세요.';
i18n.form_05030000_02 = '"{0}" 문항은 중복된 답변을 선택할 수 없습니다.';
i18n.form_05030000_03 = '"{0}" 문항의 답변을 입력해 주세요.';

i18n.form_05040000_01 = '"{0}" 문항의 {1}번째 답변을 선택해 주세요.';

i18n.form_05050000_01 = '"{0}" 문항의 {1}번째 답변을 최소 {2}개에서 최대 {3}개까지 선택해 주세요.';

i18n.form_05060000_01 = '"{0}" 문항의 {1}번째 답변을 선택해 주세요.';
i18n.form_05060000_02 = '"{0}" 문항은 중복된 답변을 선택할 수 없습니다.';

i18n.form_05070000_01 = '"{0}" 문항의 답변을 입력해 주세요.';
i18n.form_05070000_02 = '"{0}" 문항의 답변은 최대 {1} 글자까지 입력 가능합니다.';

i18n.form_05080000_01 = '"{0}" 문항의 {1}번째 답변을 입력해 주세요.';

i18n.form_05090000_01 = '"{0}" 문항의 답변을 숫자로 입력해 주세요.';
i18n.form_05090000_02 = '"{0}" 문항의 답변은 최소 1 ~ 최대 {1} 범위의 숫자만 입력 가능합니다.';

i18n.form_05100000_01 = '"{0}" 문항의 {1}번째 답변을 숫자로 입력해 주세요.';
i18n.form_05100000_02 = '"{0}" 문항이 최대 합계 {1}이 되도록 입력해 주세요.';

i18n.form_05110000_01 = '"{0}" 문항의 {1}번째 답변을 선택해 주세요.';

i18n.form_05120000_01 = '"{0}" 문항의 {1}번째 답변을 최소 {2}개에서 최대 {3}개까지 선택해 주세요.';

i18n.form_05140000_01 = '"{0}" 문항의 답변을 선택해 주세요.';